import React from 'react';

function M13AdditionalBlock() {
  return (
    <div>
      <p>30 Выполните распиновку для модуля wrapper_sum, используя планировщик выводов:</p>
      <ul>
        <li>a[3:0] — тумблеры sw[3:0];</li>
        <li>b[3:0] — тумблеры sw[7:4]</li>
        <li>co — led[0];</li>
        <li>hex[6:0] — сегменты индикатора hex0[6:0].</li>
      </ul>
      <p>
        31 Выполните программирование отладочной платы, загрузив в нее битовый поток для модуля
        wrapper_sum.
      </p>
      <p>
        32 Проверьте правильность описания модулей, поочередно вводя данные с тумблеров и получая
        сумму чисел. Сохраните несколько состояний в виде фотографий (на фотографиях должны быть
        видны положения тумблеров, светодиоды, семисегментные индикаторы).
      </p>
    </div>
  );
}

export default M13AdditionalBlock;
